
&НаКлиенте
Процедура ВычислитьКоличествоПопыток(Команда)
	
	МассивЧисел = Новый Массив;
	
	Для Шаг = 1 По ЧиселВМассиве Цикл
		МассивЧисел.Добавить(Шаг);
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	
	КоличествоПопыток = БинарныйПоиск(ЧислоПоиска, МассивЧисел);
	
	Если КоличествоПопыток = Неопределено Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Число не входит в диапозон %1'"), ЧиселВМассиве);
	Иначе
		ШаблонСообщения = НСтр("ru = 'Число %1 найдено за %2 попыток'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ЧислоПоиска, КоличествоПопыток);
	КонецЕсли;
	
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция БинарныйПоиск(ЧислоПоиска, МассивЧисел)

	КоличествоПопыток 	= 0;
	МинимальноеЧисло 	= МассивЧисел[0];
	МаксимальноеЧисло 	= МассивЧисел[МассивЧисел.ВГраница()];
	
	Пока МинимальноеЧисло <= МаксимальноеЧисло Цикл
		КоличествоПопыток = КоличествоПопыток + 1;
	 	НайденноеЧисло = Цел((МинимальноеЧисло + МаксимальноеЧисло) / 2);
		Если НайденноеЧисло = ЧислоПоиска Тогда
			Возврат КоличествоПопыток;
		ИначеЕсли НайденноеЧисло > ЧислоПоиска Тогда	
		    МаксимальноеЧисло = НайденноеЧисло - 1;
		Иначе 
			МинимальноеЧисло = НайденноеЧисло + 1;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции 

